## Pandas 학습

1. 데이터 분석을 위한 모듈
- 데이터 분석 및 가공에 사용되는 파이썬 라이브러리
- 사용빈도가 굉장히 높음
- Numpy 모듈 기반으로 생성됨

학습 내용

1. 기초 익히기
- 이미 존재하는 파일의 내용을 DataFrame 생성하기
- 중복 데이터 처리 기술
- 결측치 처리 하기
- 두개의 DataFrame 병합 : row/column기준

**주요 객체**
1. Series 
> 1. DataFrame 구성 요소
- 구조가 하나의 column으로 구성(DataFrame의 하나의 컬럼)

2. DataFrame
> A. 가로축과 세로축이 있는 엑셀과 유사한 구조<br>B.Series들로 구성

3. Series들로 구성

In [2]:
import numpy as np
import pandas as pd

In [3]:
!pip show pandas

Name: pandas
Version: 0.23.4
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: http://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\anaconda3\lib\site-packages
Requires: pytz, python-dateutil, numpy
Required-by:

기초 익히기

In [5]:
s = pd.Series([1, 2, 3])
s

0    1
1    2
2    3
dtype: int64

In [6]:
type(s)

pandas.core.series.Series

In [7]:
s.values

array([1, 2, 3], dtype=int64)

In [8]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
# 결측치 반영해 보기
# nan - Not A Number
# 결측치 반영시 Series의 각 요소의 데이터 타입 - float64
s = pd.Series([1, np.nan, 3])
s

0    1.0
1    NaN
2    3.0
dtype: float64

In [10]:
# 특정 날짜를 기준으로 자동으로 날짜 증가
# 주의 사항 : yyyymmdd 형태
datas = pd.date_range('20181210', periods=6)
datas

DatetimeIndex(['2018-12-10', '2018-12-11', '2018-12-12', '2018-12-13',
               '2018-12-14', '2018-12-15'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# DataFrame 생성 = 6행 4열
df = pd.DataFrame(np.random.randn(6, 4), index=datas)
df

                   0         1         2         3
2018-12-10 -0.111036 -0.871743 -0.052919 -1.278146
2018-12-11 -0.667699  0.811200  0.900714 -1.157399
2018-12-12 -0.317941 -0.493234 -0.660987 -1.512393
2018-12-13  0.713883 -0.002950  0.566595  1.436747
2018-12-14 -0.475401  1.891353 -0.888647  0.988505
2018-12-15 -1.249888 -1.017454  0.392418 -0.534803

In [12]:
df = pd.DataFrame(np.random.randn(6, 4), index=datas, columns=['A','B','C','D'])
df

                   A         B         C         D
2018-12-10 -1.281383  0.526754 -2.092698 -0.115127
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232
2018-12-13  0.555131 -1.019631  0.052621  0.440694
2018-12-14 -1.032854  0.523594  0.746145  0.097337
2018-12-15  0.748020  1.230242 -1.250267 -0.469713

In [13]:
df.values

array([[-1.28138265,  0.52675438, -2.09269828, -0.1151266 ],
       [ 0.23487286,  1.19266312,  0.48436467, -1.03307801],
       [-2.00026109, -1.38208894, -0.35107692,  0.57923225],
       [ 0.55513144, -1.01963125,  0.05262136,  0.44069386],
       [-1.03285385,  0.5235941 ,  0.74614507,  0.09733713],
       [ 0.74802007,  1.23024215, -1.25026683, -0.46971283]])

In [14]:
df.index

DatetimeIndex(['2018-12-10', '2018-12-11', '2018-12-12', '2018-12-13',
               '2018-12-14', '2018-12-15'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2018-12-10 to 2018-12-15
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

<font color="blue">정리 : Series 생성 방법, yyyymmdd 및 기간을 기준으로 날짜 자동 생성하는 방법,
DataFrame 객체 생성 방법, index 및 column 적용 방법, DataFrame의 정보 확인하는 방법</font>

In [17]:
df

                   A         B         C         D
2018-12-10 -1.281383  0.526754 -2.092698 -0.115127
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232
2018-12-13  0.555131 -1.019631  0.052621  0.440694
2018-12-14 -1.032854  0.523594  0.746145  0.097337
2018-12-15  0.748020  1.230242 -1.250267 -0.469713

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.462746  0.178589 -0.401818 -0.083442
std    1.126751  1.117678  1.085465  0.599759
min   -2.000261 -1.382089 -2.092698 -1.033078
25%   -1.219250 -0.633825 -1.025469 -0.381066
50%   -0.398990  0.525174 -0.149228 -0.008895
75%    0.475067  1.026186  0.376429  0.354855
max    0.748020  1.230242  0.746145  0.579232

In [19]:
df

                   A         B         C         D
2018-12-10 -1.281383  0.526754 -2.092698 -0.115127
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232
2018-12-13  0.555131 -1.019631  0.052621  0.440694
2018-12-14 -1.032854  0.523594  0.746145  0.097337
2018-12-15  0.748020  1.230242 -1.250267 -0.469713

In [21]:
# B컬럼값을 기준으로 오름차순 정렬
# 오름차순 : ascending=True
# 내림차순 : ascending=False
df.sort_values(by='B', ascending=True)

                   A         B         C         D
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232
2018-12-13  0.555131 -1.019631  0.052621  0.440694
2018-12-14 -1.032854  0.523594  0.746145  0.097337
2018-12-10 -1.281383  0.526754 -2.092698 -0.115127
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-15  0.748020  1.230242 -1.250267 -0.469713

In [22]:
df['A']

2018-12-10   -1.281383
2018-12-11    0.234873
2018-12-12   -2.000261
2018-12-13    0.555131
2018-12-14   -1.032854
2018-12-15    0.748020
Freq: D, Name: A, dtype: float64

In [23]:
type(df['A'])

pandas.core.series.Series

In [25]:
# DataFrame의 row를 index로 slicing
# [0:3] - 0, 1, 2의 row
df[0:3]

                   A         B         C         D
2018-12-10 -1.281383  0.526754 -2.092698 -0.115127
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232

In [28]:
df['2018-12-10':'2018-12-13']

                   A         B         C         D
2018-12-10 -1.281383  0.526754 -2.092698 -0.115127
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232
2018-12-13  0.555131 -1.019631  0.052621  0.440694

<font color='blue'>정리:DataFrame에서 일부 row값(index) 반환, index 번호, index명

loc 속성<br>
- 데이터를 slicing 기술
- loc[index, columns]

In [29]:
df

                   A         B         C         D
2018-12-10 -1.281383  0.526754 -2.092698 -0.115127
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232
2018-12-13  0.555131 -1.019631  0.052621  0.440694
2018-12-14 -1.032854  0.523594  0.746145  0.097337
2018-12-15  0.748020  1.230242 -1.250267 -0.469713

In [37]:
df.loc['2018-12-12',['A','B']]

A   -2.000261
B   -1.382089
Name: 2018-12-12 00:00:00, dtype: float64

In [41]:
type(df.loc['2018-12-12',['A','B']])

pandas.core.series.Series

In [48]:
df.loc['2018-12-10':'2018-12-13','A':'C']

                   A         B         C
2018-12-10 -1.281383  0.526754 -2.092698
2018-12-11  0.234873  1.192663  0.484365
2018-12-12 -2.000261 -1.382089 -0.351077
2018-12-13  0.555131 -1.019631  0.052621

iloc
- loc와 달리 행과 열의 번호를 이용해서 데이터 활용

In [49]:
df.iloc[[0,1,2],[0,1]]

                   A         B
2018-12-10 -1.281383  0.526754
2018-12-11  0.234873  1.192663
2018-12-12 -2.000261 -1.382089

In [50]:
df

                   A         B         C         D
2018-12-10 -1.281383  0.526754 -2.092698 -0.115127
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232
2018-12-13  0.555131 -1.019631  0.052621  0.440694
2018-12-14 -1.032854  0.523594  0.746145  0.097337
2018-12-15  0.748020  1.230242 -1.250267 -0.469713

In [52]:
df.iloc[0:3,0:3]

                   A         B         C
2018-12-10 -1.281383  0.526754 -2.092698
2018-12-11  0.234873  1.192663  0.484365
2018-12-12 -2.000261 -1.382089 -0.351077

문제 - 12월 12일의 B컬럼값 반환, loc?/iloc 따른 반환타입이 다름<br>
- loc - numpy의 float64타입으로 반환
- iloc - Dataframe타입으로 반환

조건식을 반영한 데이터 도출

In [54]:
df[df.A > 0]

                   A         B         C         D
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-13  0.555131 -1.019631  0.052621  0.440694
2018-12-15  0.748020  1.230242 -1.250267 -0.469713

In [55]:
# DataFrame 객체 복제해서 새로운 객체 생성해서 대입
df2 = df.copy()
df2

                   A         B         C         D
2018-12-10 -1.281383  0.526754 -2.092698 -0.115127
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232
2018-12-13  0.555131 -1.019631  0.052621  0.440694
2018-12-14 -1.032854  0.523594  0.746145  0.097337
2018-12-15  0.748020  1.230242 -1.250267 -0.469713

In [56]:
df2.iloc[0,0] = -1
df2

                   A         B         C         D
2018-12-10 -1.000000  0.526754 -2.092698 -0.115127
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232
2018-12-13  0.555131 -1.019631  0.052621  0.440694
2018-12-14 -1.032854  0.523594  0.746145  0.097337
2018-12-15  0.748020  1.230242 -1.250267 -0.469713

In [58]:
df

                   A         B         C         D
2018-12-10 -1.281383  0.526754 -2.092698 -0.115127
2018-12-11  0.234873  1.192663  0.484365 -1.033078
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232
2018-12-13  0.555131 -1.019631  0.052621  0.440694
2018-12-14 -1.032854  0.523594  0.746145  0.097337
2018-12-15  0.748020  1.230242 -1.250267 -0.469713

In [59]:
df3 = df # df 객체의 주소값 즉 객체 지향
df3.iloc[0,0] = 10
df3

                    A         B         C         D
2018-12-10  10.000000  0.526754 -2.092698 -0.115127
2018-12-11   0.234873  1.192663  0.484365 -1.033078
2018-12-12  -2.000261 -1.382089 -0.351077  0.579232
2018-12-13   0.555131 -1.019631  0.052621  0.440694
2018-12-14  -1.032854  0.523594  0.746145  0.097337
2018-12-15   0.748020  1.230242 -1.250267 -0.469713

In [60]:
df

                    A         B         C         D
2018-12-10  10.000000  0.526754 -2.092698 -0.115127
2018-12-11   0.234873  1.192663  0.484365 -1.033078
2018-12-12  -2.000261 -1.382089 -0.351077  0.579232
2018-12-13   0.555131 -1.019631  0.052621  0.440694
2018-12-14  -1.032854  0.523594  0.746145  0.097337
2018-12-15   0.748020  1.230242 -1.250267 -0.469713

In [61]:
# 이미 존재하는 DataFrame에 새로운 column 추가
df2['E'] = [1,2,3,4,np.nan,6]
df2

                   A         B         C         D    E
2018-12-10 -1.000000  0.526754 -2.092698 -0.115127  1.0
2018-12-11  0.234873  1.192663  0.484365 -1.033078  2.0
2018-12-12 -2.000261 -1.382089 -0.351077  0.579232  3.0
2018-12-13  0.555131 -1.019631  0.052621  0.440694  4.0
2018-12-14 -1.032854  0.523594  0.746145  0.097337  NaN
2018-12-15  0.748020  1.230242 -1.250267 -0.469713  6.0

In [63]:
df['A'].max()-df['A'].min()

12.000261093103763

In [64]:
#? 모든 컬럼의 최대값 - 최소값 연산하기

In [66]:
df.apply(lambda x : x.max() - x.min())

A    12.000261
B     2.612331
C     2.838843
D     1.612310
dtype: float64

In [70]:
# ? 이 apply()가 몇번 호출될지 파악하는 로직을 lambda로 단순 확인 해 보기
df.apply(lambda x : print(x,1))

2018-12-10    10.000000
2018-12-11     0.234873
2018-12-12    -2.000261
2018-12-13     0.555131
2018-12-14    -1.032854
2018-12-15     0.748020
Freq: D, Name: A, dtype: float64 1
2018-12-10    0.526754
2018-12-11    1.192663
2018-12-12   -1.382089
2018-12-13   -1.019631
2018-12-14    0.523594
2018-12-15    1.230242
Freq: D, Name: B, dtype: float64 1
2018-12-10   -2.092698
2018-12-11    0.484365
2018-12-12   -0.351077
2018-12-13    0.052621
2018-12-14    0.746145
2018-12-15   -1.250267
Freq: D, Name: C, dtype: float64 1
2018-12-10   -0.115127
2018-12-11   -1.033078
2018-12-12    0.579232
2018-12-13    0.440694
2018-12-14    0.097337
2018-12-15   -0.469713
Freq: D, Name: D, dtype: float64 1

A    None
B    None
C    None
D    None
dtype: object

이미 존재하는 파일의 내용을 기반으로 DataFrame 생성하기

In [73]:
# 외부 폴더의 file을 read -> DataFrame 객체 생성하기
'''
이 파일이 내장된 경로 : C:\0.ITstudy\9.Pandas\step01~
friends.csv : C:\0.ITstudy\0.dataSet
'''
df = pd.read_csv("../0.dataSet/friends.csv")
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [74]:
type(df)

pandas.core.frame.DataFrame

In [75]:
df['이름']

0    신동엽
1    유재석
2    김새롬
3    이영자
4    강호동
Name: 이름, dtype: object

In [86]:
#? 이영자 이름을 이영순으로 변경해 보기
df['이름'][3]

'이영순'

In [82]:
df

    이름  나이   직업  hobby  이영자
0  신동엽  20  연예인  music  이영순
1  유재석  41   교수    art  이영순
2  김새롬  18   학생  study  이영순
3  이영순  45  상담사   talk  이영순
4  강호동  38  연예인   talk  이영순

In [93]:
# tab으로 데이터를 구분한 파일의 내용으로 DataFrame 객체 생성하기
df = pd.read_csv("../0.dataSet/friends.txt", delimiter="\t")
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

원천 데이터(raw)에 컬럼명으로 사용될 header 정보가 없을 경우 주의사항<br>
DataFrame 생성시 데이터의 첫 라인이 header 정보로 사용되지
않게 속성으로 제어해야 함<br>
1단계 실습 : 신동엽 정보가 header 정보로 사용 -> columns 추가 -> 정보 손실<br>
2단계 실습 : 신동엽 정보 손실없이 작업<br>

In [94]:
# 1단계
# header 정보가 없는 파일을 read해서 가공하기
df = pd.read_csv("../0.dataSet/friendsNoHead.txt", delimiter="\t")
df

   신동엽  20  연예인  music
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

In [92]:
df.columns

Index(['신동엽', '20', '연예인', 'music'], dtype='object')

In [96]:
df.columns = ['name','age','job','hobby']
df

  name  age  job  hobby
0  유재석   41   교수    art
1  김새롬   18   학생  study
2  이영자   45  상담사   talk
3  강호동   38  연예인   talk

In [101]:
# 2단계
df = pd.read_csv("../0.dataSet/friendsNoHead.txt", delimiter="\t", header=None)
df

     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [102]:
df.columns = ['name','age','job','hobby']
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [105]:
# 3단계
df = pd.read_csv("../0.dataSet/friendsNoHead.txt", delimiter="\t", header=None, names=['name','age','job','hobby'])
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

python data 타입으로 부터 DataFrame 생성 및 가공

In [106]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'}]

In [107]:
friend_dict_list, type(friend_dict_list)

([{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
  {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
  {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
  {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
  {'name': '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'}],
 list)

In [108]:
friend_dict_list[0]['name']

'신동엽'

In [109]:
type(friend_dict_list[0]['name'])

str

In [110]:
df = pd.DataFrame(friend_dict_list)
df

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석
2   18  study   학생  김새롬
3   45   talk  상담사  이영자
4   38   talk  연예인  강호동

In [111]:
df.name

0    신동엽
1    유재석
2    김새롬
3    이영자
4    강호동
Name: name, dtype: object

In [112]:
type(df.name)

pandas.core.series.Series

In [113]:
df.head()

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석
2   18  study   학생  김새롬
3   45   talk  상담사  이영자
4   38   talk  연예인  강호동

In [114]:
df.tail()

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석
2   18  study   학생  김새롬
3   45   talk  상담사  이영자
4   38   talk  연예인  강호동

In [115]:
df.head(2)

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석

In [116]:
df = df[['name','age','job','hobby']]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [120]:
#? df2 라는 변수한테 friend_dict_list가 보유한 일반 python의 list로
# DataFrame 생성, 단 컬럼 순서는 name age job hobby 순으로 생성
#? 생성 시점에 컬럼순서 정할 수 있나?
df2 = pd.DataFrame(friend_dict_list,index=['영','일','이','삼','사'] ,columns=['name','age','job','hobby'])
df2

  name  age  job  hobby
영  신동엽   20  연예인  music
일  유재석   41   교수    art
이  김새롬   18   학생  study
삼  이영자   45  상담사   talk
사  강호동   38  연예인   talk

정제한 DataFrame을 csv 파일로 생성하기

In [122]:
df2

  name  age  job  hobby
영  신동엽   20  연예인  music
일  유재석   41   교수    art
이  김새롬   18   학생  study
삼  이영자   45  상담사   talk
사  강호동   38  연예인   talk

In [123]:
df2.to_csv("../0.dataSet/f1_out.csv",index=None)

In [126]:
#? 컬럼명도 배제해서 f2_out.csv 생성해 보기
df2.to_csv("../0.dataSet/f2_out.csv",index=None, header=None)

In [130]:
#리스트로 데이터 프레임 생성하기 + header 추가 하기

friends = [['신동엽',20,'연예인','music'], 
           ['유재석',41,'교수','art'], 
           ['김새롬',18,'학생','study'], 
           ['이영자',45,'상담사','talk'], 
           ['강호동',38,'연예인','talk']]

df = pd.DataFrame.from_records(friends, columns=['name','age','job','hobby'])

In [131]:
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [134]:
df.columns = ['name','age','job','hobby']
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [135]:
df['salary'] = [1,2,3,4,5]

In [136]:
df

  name  age  job  hobby  salary
0  신동엽   20  연예인  music       1
1  유재석   41   교수    art       2
2  김새롬   18   학생  study       3
3  이영자   45  상담사   talk       4
4  강호동   38  연예인   talk       5

In [146]:
# job이 학생인 경우 salary값이 yes, 학생인 경우 no값으로 치환 하기
# np.where()
'''
    salary 컬럼에 no or yes 대입 : df['salary'] = no or yes
    상황에 따른 조건 job 학생? non-학생? : df['job'] != '학생'
    
    상항연산자
        조건식? true일떄:false일때
'''

df['salary'] = np.where(df['job'] != '학생', 'yes', 'no') # true, false
df

  name  age  job  hobby salary
0  신동엽   20  연예인  music    yes
1  유재석   41   교수    art    yes
2  김새롬   18   학생  study     no
3  이영자   45  상담사   talk    yes
4  강호동   38  연예인   talk    yes

중복 데이터 처리 기술

1. 1단계 - 100% 모든 데이터 동일한 것으로 test<br>
- 2단계 - age 컬럼값만 다를 경우 중복이 아니다

In [147]:
#step01
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   20  연예인  music

In [148]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [149]:
df = df.drop_duplicates()
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [167]:
#step02
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': 21, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   21  연예인  music

In [151]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [152]:
df['name'].duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
Name: name, dtype: bool

In [165]:
# step03 - 컬럼 데이터만을 기준으로 중복 여부 확인 후에 삭제 가능
df = df.drop_duplicates(['name'],keep='first')
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [170]:
df.drop_duplicates(['name'],keep='last')

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   21  연예인  music

In [171]:
df.drop_duplicates(['name'],keep=0) #inplace=True하면 원본 삭제됨

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [174]:
# inplace=True : 원본 DataFrame에 영향을 주는 속성
df.drop_duplicates(['name'],keep='last', inplace=True)
df

  name  age  job  hobby
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk
5  신동엽   21  연예인  music

In [217]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]

In [176]:
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [177]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
name     6 non-null object
age      5 non-null float64
job      6 non-null object
hobby    6 non-null object
dtypes: float64(1), object(3)
memory usage: 272.0+ bytes

In [181]:
# 결측치 확인 함수, 결측치인 경우에만 True
df.isna() # df.isnull()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [182]:
df.isnull()

    name    age    job  hobby
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False   True  False  False

In [187]:
#? 모든 친구들의 age의 합? 평균?
df['age'].sum()

162.0

In [188]:
df['age']

0    20.0
1    41.0
2    18.0
3    45.0
4    38.0
5     NaN
Name: age, dtype: float64

In [189]:
df['age'].sum()/len(df['age'])

27.0

In [193]:
df['age'].mean()

32.4

In [220]:
'''
nan 값을 0으로 치환, 평균을 제대로 도출
'''
df['age'].fillna(0, inplace=True) # true, false
df
df['age'].mean()

27.0